Revit 2027 API
IFCData.AsInstance Method
 Gets storage value as IFCAnyHandle when its PrimitiveType is instance.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAnyHandle AsInstance()
Public Function AsInstance As IFCAnyHandle
public:
IFCAnyHandle^ AsInstance()
member AsInstance : unit -> IFCAnyHandle
Return Value
IFCAnyHandle
 The IFCAnyHandle.
Exceptions
Exception | Condition
InapplicableDataException |  The primitive type is not instance.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace